// 网页简繁体转换   
// 本js用于客户在网站页面选择繁体中文或简体中文显示，默认是正常显示，即简繁体同时显示   
// 在用户第一次访问网页时,会自动检测客户端语言进行操作并提示.此功能可关闭   
// 本程序只在UTF8编码下测试过，不保证其他编码有效   

// -------------- 以下参数大部分可以更改 --------------------   
//s = simplified 简体中文 t = traditional 繁体中文 n = normal 正常显示   
var zh_default = 'n'; //默认语言，请不要改变   
var zh_choose = 'n'; //当前选择   
var zh_expires = 7; //cookie过期天数   
var zh_class = 'zh_click'; //链接的class名，id为class + s/t/n 之一   
var zh_style_active = 'font-weight:bold; color:green;'; //当前选择的链接式样   
var zh_style_inactive = 'color:blue;'; //非当前选择的链接式样   
var zh_browserLang = ''; //浏览器语言   
var zh_autoLang_t = true; //浏览器语言为繁体时自动进行操作   
var zh_autoLang_s = false; //浏览器语言为简体时自动进行操作   
var zh_autoLang_alert = true; //自动操作后是否显示提示消息   
//自动操作后的提示消息   
var zh_autoLang_msg = '歡迎來到本站,本站爲方便台灣香港的用戶\n1.采用UTF-8國際編碼,用任何語言發帖都不用轉碼.\n2.自動判斷繁體用戶,顯示繁體網頁\n3.在網頁最上方有語言選擇,如果浏覽有問題時可以切換\n4.本消息在cookie有效期內只顯示一次';
var zh_autoLang_checked = 0; //次检测浏览器次数,第一次写cookie为1,提示后为2,今后将不再提示   


//判断浏览器语言的正则,ie为小写,ff为大写   
var zh_langReg_t = /^zh-tw|zh-hk$/i;
var zh_langReg_s = /^zh-cn$/i;

//简体繁体对照字表,可以自行替换   
var zh_s = '锕锿皑嗳蔼霭爱碍嫒瑷暧桉谙鹌埯铵肮翱鳌袄媪岙奥骜钯坝罢鲅摆败颁坂板钣办绊帮绑谤镑龅饱宝鸨报鲍鹎贝狈备钡辈惫鞴呗贲锛绷笔币毕闭荜哔毙铋筚跸滗边笾编鳊贬苄变缏辩辫标飑骠飙镖飚镳鳔鳖鳖别瘪宾傧滨缤槟镔濒摈殡膑髌鬓饼禀并拨钵饽剥驳钹铂鹁卜钸补钚财参骖残蚕惭惨黪灿仓伧苍沧舱册厕侧测恻层馇锸镲诧钗侪虿觇掺搀谗婵馋禅缠蝉镡产产谄铲阐蒇骣冁忏颤伥阊鲳苌肠尝偿厂场怅畅钞车砗彻尘沉陈谌碜衬龀榇谶柽称蛏撑枨诚铖惩骋鸱痴驰迟齿耻饬炽冲虫宠铳俦帱绸畴筹踌雠丑刍厨锄雏橱蹰础储处绌触憷传钏疮闯创怆锤纯莼鹑绰辍龊词辞鹚赐苁囱枞葱骢聪从丛凑辏撺镩蹿窜鹾锉错哒达鞑骀绐带贷担单郸殚瘅箪胆掸赕诞惮弹澹当铛裆挡党谠凼砀荡档导岛捣祷盗锝灯邓镫镝籴敌涤觌诋递谛缔颠巅癫点电垫钿淀凋鲷钓调铞铫迭谍叠鲽钉顶订铤锭丢铥东岽鸫动冻栋胨钭斗窦独读渎椟犊牍黩笃赌镀断缎煅锻簖队对兑怼吨镦趸炖钝顿夺铎缍堕讹锇鹅额轭垩恶饿阏谔鹗锷颚鳄诶儿鸸鲕尔迩饵铒贰发罚阀珐矾钒烦饭范贩钫鲂访纺飞绯鲱诽废费镄纷坟奋偾粪愤鲼丰风沣枫砜疯锋冯讽凤缝肤麸凫绂绋辐幞抚辅讣负妇驸复复赋鲋缚赙鳆钆该赅钙盖杆尴秆赶擀干绀赣冈刚纲钢岗戆皋槔睾缟镐藁诰锆纥鸽搁阁镉个铬给亘赓绠鲠宫龚巩贡沟钩钩缑苟构购诟够觏轱鸪菰诂钴蛊鹄毂鹘顾锢鲴鸹剐诖挂掴关观鳏馆贯掼惯鹳广犷归龟妫规闺硅鲑轨匦诡柜刿刽贵桧鳜衮绲辊滚磙鲧呙埚锅蝈国帼椁过铪还骇顸韩汉颔绗颃蚝号颢灏诃阂颌阖贺鹤横轰红闳荭鸿黉讧后鲎轷壶煳鹕浒户护沪鹱哗华骅铧划画话桦怀坏欢环锾缳缓奂换唤涣焕痪鲩黄鳇谎诙挥咴珲晖辉毁汇汇会讳荟哕浍诲绘贿烩秽缋荤阍浑馄诨溷锪伙钬货获祸镬嚯讥击叽饥玑机矶鸡积赍缉跻齑羁级极辑嵴几虮挤计记纪际剂荠哜迹济觊继绩蓟霁鲚鲫骥夹浃镓郏荚铗颊蛱贾钾价驾戋歼坚间艰监笺缄缣鲣鹣鞯拣枧茧俭捡笕检减硷睑锏裥简谫戬碱见饯荐贱剑舰涧渐谏践溅鉴键将浆缰讲奖桨蒋绛酱浇娇骄胶鲛鹪纟侥挢饺绞铰矫脚搅徼缴峤轿较阶疖秸节讦杰诘洁结颉鲒届诫仅尽卺紧锦谨馑进劲荩晋赆烬缙觐茎泾经荆惊鲸刭颈径净净弪迳胫痉竞靓静镜纠鸠阄旧厩鹫驹锔举榉龃讵钜剧据惧飓锯窭屦鹃镌锩隽桊绢噘决诀珏觉绝谲镢军钧皲骏咔开锎剀凯垲恺铠锴忾龛槛阚闶钪铐轲钶疴颏颗壳课骒缂锞垦恳铿抠眍库绔喾裤夸块侩郐哙狯脍宽髋诓诳邝圹纩旷况矿贶亏岿窥匮蒉馈溃愦聩篑锟鲲阃扩阔腊蜡来莱崃徕涞铼赉睐赖濑癞籁兰岚拦栏阑蓝谰澜褴篮斓镧览揽缆榄漤懒烂滥阆琅锒捞劳唠崂铹痨铑涝耢乐鳓缧镭诔垒泪类愣狸离骊鹂蓠缡鲡篱礼里里逦锂鲤鳢历历厉坜苈丽励呖沥枥疠隶栎郦轹俪疬莅砺砾蛎粝雳跞俩奁连怜帘莲涟联裢鲢镰琏敛脸裣蔹练炼恋殓链链潋凉粮两魉谅辆辽疗缭鹩钌镣猎邻临辚鳞凛廪懔檩赁蔺躏灵铃凌棂绫龄鲮岭领熘刘浏馏骝镏绺锍鹨龙茏咙泷珑栊胧砻聋笼陇垅拢垄娄偻蒌喽楼耧蝼髅搂嵝篓镂瘘撸噜卢芦庐垆炉泸栌轳胪鸬颅舻鲈卤虏掳鲁橹镥陆录辂赂渌禄辘鹭氇峦孪娈栾挛鸾脔滦銮乱抡仑伦囵沦纶轮论罗萝逻脶猡椤锣箩骡镙泺荦络骆驴闾榈吕侣铝稆屡缕褛虑绿滤锊呒妈马犸玛码蚂杩骂吗买荬劢迈麦卖脉唛颟蛮馒瞒鳗满螨谩缦镘猫锚铆贸么么没镅鹛霉镁门扪钔闷焖懑们勐锰梦眯弥祢猕谜芈觅幂谧绵黾渑缅腼鹋淼缈庙灭珉缗闵闽悯愍鳘鸣铭谬谟馍麽嬷殁蓦镆谋缪亩钼镎呐纳钠难馕挠铙蛲垴恼脑闹讷馁内铌鲵拟腻鲇鲶捻辇撵埝酿鸟茑袅陧聂啮啮嗫镊镍颞蹑蘖宁宁拧咛狞柠聍甯泞纽钮农侬哝浓脓驽疟傩诺锘钕讴沤瓯欧殴鸥呕怄盘蹒彷庞抛狍疱赔锫辔喷鹏纰噼铍罴骈谝骗缥飘贫频嫔颦评苹凭鲆钋泼颇钷扑镤朴谱镨铺栖桤凄齐颀脐骐骑蛴蕲鳍岂启启绮气讫弃碛扦迁佥钎钎牵铅悭谦签骞钤钱钳潜肷浅谴缱堑椠呛枪戗锖锵镪强墙墙蔷嫱樯抢羟襁炝跄硗跷锹缲乔侨荞桥谯鞒诮窍翘郄窃惬锲箧钦亲锓寝吣揿轻氢倾鲭苘顷请庆穷茕琼鳅赇巯区岖诎驱躯趋麴鸲癯龋阒觑权诠辁铨颧绻劝阙却悫确阕鹊让荛饶娆桡扰绕热认纫韧轫饪荣绒嵘蝾铷颥缛软锐闰润洒飒萨鳃赛叁毵伞糁馓颡丧骚缫鳋扫涩啬铯穑杀纱刹铩鲨厦筛酾晒删钐姗闪陕陕讪骟缮赡鳝伤殇觞墒垧赏绱烧绍赊畲厍设摄滠慑谁诜绅审谂渖婶肾渗声绳圣胜尸师诗狮湿鲺时识实蚀埘莳鲥驶势饰试视贳适轼铈弑释谥寿兽绶书纾枢摅输赎属术树竖数帅闩双税顺说烁铄硕丝咝鸶蛳缌厮锶饲驷怂耸讼诵颂馊飕锼擞薮苏稣诉肃谡虽绥随岁谇孙荪狲损笋睃缩唢琐锁铊獭鳎挞闼台抬鲐态钛贪摊滩瘫坛昙谈锬谭钽叹叹汤铴镗饧傥烫涛绦绦焘韬讨铽腾誊锑绨鹈缇题体屉阗条龆鲦粜贴铁厅听烃铜统恸头秃图涂钍团抟颓蜕饨脱驮驼鸵鼍椭箨洼娲袜腽弯湾纨顽绾万网辋韦违围帏闱沩涠维潍伟伪伪苇纬玮炜诿韪鲔卫为为谓喂温纹闻阌稳问瓮挝莴涡窝蜗卧龌乌邬污呜钨诬无芜吴庑怃妩鹉务坞误骛雾鹜牺锡习觋袭玺铣戏饩细阋虾侠峡狭硖辖吓纤籼莶跹锨鲜闲贤咸娴衔痫鹇显险蚬猃藓苋县岘现线宪馅羡献乡芗厢缃骧镶详响饷飨鲞项枭哓骁绡萧销箫潇嚣晓啸蝎协胁挟谐携撷缬写泄泻绁亵谢锌衅陉荥兴凶汹鸺馐绣锈锈吁须顼虚嘘许诩叙绪续溆轩谖悬选癣绚铉镟学泶鳕谑勋勋埙寻询荨浔鲟训讯驯逊压垭鸦桠鸭哑痖轧亚讶娅氩恹烟阉讠闫严岩盐阎颜颜兖俨厣魇鼹厌砚彦艳艳验谚滟酽餍谳赝鸯扬阳杨炀疡养痒样尧轺窑谣摇遥瑶鳐药钥鹞爷铘业叶页邺晔烨谒靥医铱仪诒饴贻遗颐彝钇蚁舣亿义艺忆议异呓译峄怿诣绎驿轶谊缢瘗镒镱阴荫铟银龈饮隐瘾应莺婴撄嘤罂缨璎樱鹦鹰茔荧莹萤营萦蓥滢蝇潆赢颍颖瘿哟佣拥痈镛鳙咏涌踊优忧邮犹莜莸铀鱿游铕诱纡于欤余鱼馀谀娱渔嵛觎舆与屿伛俣语龉驭饫妪狱钰预阈谕御鹆蓣誉鹬鸢鸳渊园员圆鼋缘辕橼远愿约岳钺阅悦跃粤晕氲云匀芸纭郧陨殒运郓恽酝愠韫韵蕴杂灾载攒趱暂錾赞瓒赃驵脏脏凿枣灶则责择泽啧帻箦赜贼谮缯锃赠扎吒揸齄札闸铡诈栅斋债毡谵斩盏崭辗栈战绽张长涨帐账胀钊诏赵辄蛰谪辙锗这鹧着贞针侦帧浈桢祯诊轸缜阵鸩赈镇争挣峥狰钲睁铮筝证郑诤症织栀执职絷踯只纸轵志帜质栉贽挚轾致鸷掷滞骘踬觯终钟钟锺肿种众众诌轴纣绉荮昼皱骤诛诸铢猪槠潴橥烛嘱瞩伫苎贮注驻铸筑专砖颛转啭赚馔妆庄桩装丬壮状骓锥坠缀缒赘谆准浊诼镯兹赀资谘缁辎锱龇鲻眦渍综踪总偬纵邹驺诹鲰镞诅组钻钻躜缵鳟';
var zh_t = '錒鎄皚噯藹靄愛礙嬡璦曖案諳鵪垵銨骯翺鰲襖媼嶴奧驁鈀壩罷鮁擺敗頒阪闆鈑辦絆幫綁謗鎊齙飽寶鴇報鮑鵯貝狽備鋇輩憊韝唄賁錛繃筆幣畢閉蓽嗶斃鉍篳蹕潷邊籩編鯿貶芐變緶辯辮標颮驃飆鏢飈鑣鰾鼈鱉別癟賓儐濱繽檳鑌瀕擯殯臏髕鬢餅稟並撥缽餑剝駁鈸鉑鵓蔔鈽補鈈財參驂殘蠶慚慘黲燦倉傖蒼滄艙冊廁側測惻層餷鍤鑔詫釵儕蠆覘摻攙讒嬋饞禪纏蟬鐔産產諂鏟闡蕆驏囅懺顫倀閶鯧萇腸嘗償廠場悵暢鈔車硨徹塵沈陳諶磣襯齔櫬讖檉稱蟶撐棖誠鋮懲騁鴟癡馳遲齒恥飭熾沖蟲寵銃儔幬綢疇籌躊讎醜芻廚鋤雛櫥躕礎儲處絀觸怵傳釧瘡闖創愴錘純蒓鶉綽輟齪詞辭鶿賜蓯囪樅蔥驄聰從叢湊輳攛鑹躥竄鹺銼錯噠達韃駘紿帶貸擔單鄲殫癉簞膽撣賧誕憚彈淡當鐺襠擋黨讜氹碭蕩檔導島搗禱盜鍀燈鄧鐙鏑糴敵滌覿詆遞諦締顛巔癲點電墊鈿澱雕鯛釣調銱銚叠諜疊鰈釘頂訂鋌錠丟銩東崠鶇動凍棟腖鈄鬥竇獨讀瀆櫝犢牘黷篤賭鍍斷緞煆鍛籪隊對兌懟噸鐓躉燉鈍頓奪鐸綞墮訛鋨鵝額軛堊惡餓閼諤鶚鍔顎鱷誒兒鴯鮞爾邇餌鉺貳發罰閥琺礬釩煩飯範販鈁魴訪紡飛緋鯡誹廢費鐨紛墳奮僨糞憤鱝豐風灃楓碸瘋鋒馮諷鳳縫膚麩鳧紱紼輻襆撫輔訃負婦駙複復賦鮒縛賻鰒釓該賅鈣蓋桿尷稈趕搟幹紺贛岡剛綱鋼崗戇臯橰睪縞鎬槁誥鋯紇鴿擱閣鎘個鉻給亙賡綆鯁宮龔鞏貢溝鈎鉤緱茍構購詬夠覯軲鴣菇詁鈷蠱鵠轂鶻顧錮鯝鴰剮詿掛摑關觀鰥館貫摜慣鸛廣獷歸龜媯規閨矽鮭軌匭詭櫃劌劊貴檜鱖袞緄輥滾滾鯀咼堝鍋蟈國幗槨過鉿還駭頇韓漢頷絎頏蠔號顥灝訶閡頜闔賀鶴橫轟紅閎葒鴻黌訌後鱟軤壺糊鶘滸戶護滬鸌嘩華驊鏵劃畫話樺懷壞歡環鍰繯緩奐換喚渙煥瘓鯇黃鰉謊詼揮噅琿暉輝毀彙匯會諱薈噦澮誨繪賄燴穢繢葷閽渾餛諢混鍃夥鈥貨獲禍鑊謔譏擊嘰饑璣機磯雞積賫緝躋齏羈級極輯脊幾蟣擠計記紀際劑薺嚌跡濟覬繼績薊霽鱭鯽驥夾浹鎵郟莢鋏頰蛺賈鉀價駕戔殲堅間艱監箋緘縑鰹鶼韉揀梘繭儉撿筧檢減鹼瞼鐧襇簡譾戩堿見餞薦賤劍艦澗漸諫踐濺鑒鍵將漿韁講獎槳蔣絳醬澆嬌驕膠鮫鷦糸僥撟餃絞鉸矯腳攪僥繳嶠轎較階癤稭節訐傑詰潔結頡鮚屆誡僅盡巹緊錦謹饉進勁藎晉贐燼縉覲莖涇經荊驚鯨剄頸徑淨凈弳逕脛痙競靚靜鏡糾鳩鬮舊廄鷲駒鋦舉櫸齟詎鉅劇據懼颶鋸窶屨鵑鐫錈雋棬絹撅決訣玨覺絕譎鐝軍鈞皸駿哢開鐦剴凱塏愷鎧鍇愾龕檻闞閌鈧銬軻鈳屙頦顆殼課騍緙錁墾懇鏗摳瞘庫絝嚳褲誇塊儈鄶噲獪膾寬髖誆誑鄺壙纊曠況礦貺虧巋窺匱蕢饋潰憒聵簣錕鯤閫擴闊臘蠟來萊崍徠淶錸賚睞賴瀨癩籟蘭嵐攔欄闌藍讕瀾襤籃斕鑭覽攬纜欖濫懶爛濫閬瑯鋃撈勞嘮嶗鐒癆銠澇耮樂鰳縲鐳誄壘淚類楞貍離驪鸝蘺縭鱺籬禮裏裡邐鋰鯉鱧曆歷厲壢藶麗勵嚦瀝櫪癘隸櫟酈轢儷癧蒞礪礫蠣糲靂躒倆奩連憐簾蓮漣聯褳鰱鐮璉斂臉襝蘞練煉戀殮鏈鍊瀲涼糧兩魎諒輛遼療繚鷯釕鐐獵鄰臨轔鱗凜廩懍檁賃藺躪靈鈴淩欞綾齡鯪嶺領溜劉瀏餾騮鎦綹鋶鷚龍蘢嚨瀧瓏櫳朧礱聾籠隴壟攏壟婁僂蔞嘍樓耬螻髏摟嶁簍鏤瘺擼嚕盧蘆廬壚爐瀘櫨轤臚鸕顱艫鱸鹵虜擄魯櫓鑥陸錄輅賂淥祿轆鷺氌巒孿孌欒攣鸞臠灤鑾亂掄侖倫圇淪綸輪論羅蘿邏腡玀欏鑼籮騾鏍濼犖絡駱驢閭櫚呂侶鋁穭屢縷褸慮綠濾鋝嘸媽馬獁瑪碼螞榪罵嗎買蕒勱邁麥賣脈嘜顢蠻饅瞞鰻滿蟎謾縵鏝貓錨鉚貿麽麼沒鎇鶥黴鎂門捫鍆悶燜懣們猛錳夢瞇彌禰獼謎羋覓冪謐綿黽澠緬靦鶓渺緲廟滅瑉緡閔閩憫湣鰵鳴銘謬謨饃麼嬤歿驀鏌謀繆畝鉬鎿吶納鈉難饢撓鐃蟯堖惱腦鬧訥餒內鈮鯢擬膩鮎鯰撚輦攆墊釀鳥蔦裊隉聶齧嚙囁鑷鎳顳躡蘗甯寧擰嚀獰檸聹寧濘紐鈕農儂噥濃膿駑瘧儺諾鍩釹謳漚甌歐毆鷗嘔慪盤蹣仿龐拋麅皰賠錇轡噴鵬紕劈鈹羆駢諞騙縹飄貧頻嬪顰評蘋憑鮃釙潑頗鉕撲鏷樸譜鐠鋪棲榿淒齊頎臍騏騎蠐蘄鰭豈啓啟綺氣訖棄磧扡遷僉釺釬牽鉛慳謙簽騫鈐錢鉗潛膁淺譴繾塹槧嗆槍戧錆鏘鏹強牆墻薔嬙檣搶羥繈熗蹌磽蹺鍬繰喬僑蕎橋譙鞽誚竅翹郤竊愜鍥篋欽親鋟寢唚撳輕氫傾鯖檾頃請慶窮煢瓊鰍賕巰區嶇詘驅軀趨麯鴝臒齲闃覷權詮輇銓顴綣勸闕卻愨確闋鵲讓蕘饒嬈橈擾繞熱認紉韌軔飪榮絨嶸蠑銣顬縟軟銳閏潤灑颯薩鰓賽三毿傘糝饊顙喪騷繅鰠掃澀嗇銫穡殺紗剎鎩鯊廈篩釃曬刪釤姍閃陝陜訕騸繕贍鱔傷殤觴墑坰賞緔燒紹賒畬厙設攝灄懾誰詵紳審諗瀋嬸腎滲聲繩聖勝屍師詩獅濕鯴時識實蝕塒蒔鰣駛勢飾試視貰適軾鈰弒釋謚壽獸綬書紓樞攄輸贖屬術樹豎數帥閂雙稅順說爍鑠碩絲噝鷥螄緦廝鍶飼駟慫聳訟誦頌餿颼鎪擻藪蘇穌訴肅謖雖綏隨歲誶孫蓀猻損筍脧縮嗩瑣鎖鉈獺鰨撻闥臺擡鮐態鈦貪攤灘癱壇曇談錟譚鉭歎嘆湯鐋鏜餳儻燙濤縧絳燾韜討鋱騰謄銻綈鵜緹題體屜闐條齠鰷糶貼鐵廳聽烴銅統慟頭禿圖塗釷團摶頹蛻飩脫馱駝鴕鼉橢籜窪媧襪膃彎灣紈頑綰萬網輞韋違圍幃闈溈潿維濰偉僞偽葦緯瑋煒諉韙鮪衛爲為謂餵溫紋聞閿穩問甕撾萵渦窩蝸臥齷烏鄔汙嗚鎢誣無蕪吳廡憮嫵鵡務塢誤騖霧鶩犧錫習覡襲璽銑戲餼細鬩蝦俠峽狹硤轄嚇纖秈薟躚鍁鮮閑賢鹹嫻銜癇鷴顯險蜆獫蘚莧縣峴現線憲餡羨獻鄉薌廂緗驤鑲詳響餉饗鯗項梟嘵驍綃蕭銷簫瀟囂曉嘯蠍協脅挾諧攜擷纈寫洩瀉紲褻謝鋅釁陘滎興兇洶鵂饈繡鏽銹籲須頊虛噓許詡敘緒續漵軒諼懸選癬絢鉉鏇學澩鱈謔勳勛塤尋詢蕁潯鱘訓訊馴遜壓埡鴉椏鴨啞瘂軋亞訝婭氬懨煙閹訁閆嚴巖鹽閻顔顏兗儼厴魘鼴厭硯彥豔艷驗諺灩釅饜讞贗鴦揚陽楊煬瘍養癢樣堯軺窯謠搖遙瑤鰩藥鑰鷂爺鋣業葉頁鄴曄燁謁靨醫銥儀詒飴貽遺頤彜釔蟻艤億義藝憶議異囈譯嶧懌詣繹驛軼誼縊瘞鎰鐿陰蔭銦銀齦飲隱癮應鶯嬰攖嚶罌纓瓔櫻鸚鷹塋熒瑩螢營縈鎣瀅蠅瀠贏潁穎癭喲傭擁癰鏞鱅詠湧踴優憂郵猶蓧蕕鈾魷遊銪誘紆於歟餘魚餘諛娛漁崳覦輿與嶼傴俁語齬馭飫嫗獄鈺預閾諭禦鵒蕷譽鷸鳶鴛淵園員圓黿緣轅櫞遠願約嶽鉞閱悅躍粵暈氳雲勻蕓紜鄖隕殞運鄆惲醞慍韞韻蘊雜災載攢趲暫鏨贊瓚贓駔髒臟鑿棗竈則責擇澤嘖幘簀賾賊譖繒鋥贈紮咤摣齇劄閘鍘詐柵齋債氈譫斬盞嶄輾棧戰綻張長漲帳賬脹釗詔趙輒蟄謫轍鍺這鷓著貞針偵幀湞楨禎診軫縝陣鴆賑鎮爭掙崢猙鉦睜錚箏證鄭諍癥織梔執職縶躑隻紙軹誌幟質櫛贄摯輊緻鷙擲滯騭躓觶終鍾鐘鍾腫種衆眾謅軸紂縐葤晝皺驟誅諸銖豬櫧瀦櫫燭囑矚佇苧貯註駐鑄築專磚顓轉囀賺饌妝莊樁裝爿壯狀騅錐墜綴縋贅諄準濁諑鐲茲貲資諮緇輜錙齜鯔眥漬綜蹤總傯縱鄒騶諏鯫鏃詛組鑽鉆躦纘鱒';
String.prototype.tran = function () {
	var s1, s2;
	if (zh_choose == 't') {
		s1 = zh_s;
		s2 = zh_t;
	} else if (zh_choose == 's') {
		s1 = zh_t;
		s2 = zh_s;
	} else {
		return this;
	}
	var a = '';
	var l = this.length;
	for (var i = 0; i < this.length; i++) {
		var c = this.charAt(i);
		var p = s1.indexOf(c)
		a += p < 0 ? c : s2.charAt(p);
	}
	return a;
}

function zh_tranBody(obj) {
	var o = (typeof (obj) == "object") ? obj.childNodes : document.body.childNodes;
	for (var i = 0; i < o.length; i++) {
		var c = o.item(i);
		if ('||BR|HR|TEXTAREA|SCRIPT|'.indexOf("|" + c.tagName + "|") > 0) continue;
		if (c.className == zh_class) {
			if (c.id == zh_class + '_' + zh_choose) {
				c.setAttribute('style', zh_style_active);
				c.style.cssText = zh_style_active;
			} else {
				c.setAttribute('style', zh_style_inactive);
				c.style.cssText = zh_style_inactive;
			}
			continue;
		}
		if (c.title != '' && c.title != null) c.title = c.title.tran();
		if (c.alt != '' && c.alt != null) c.alt = c.alt.tran();
		if (c.tagName == "INPUT" && c.value != '' && c.type != 'text' && c.type != 'hidden' && c.type != 'password') c.value = c.value.tran();
		if (c.nodeType == 3) {
			c.data = c.data.tran();
		} else {
			zh_tranBody(c);
		}
	}
}

function zh_tran(go) {
	if (go) zh_choose = go;
	setCookie('zh_choose', zh_choose, zh_expires);
	if (go == 'n') {
		window.location.reload();
	} else {
		zh_tranBody();
	}
}

function zh_getLang() {
	if (getCookie('zh_choose')) {
		zh_choose = getCookie('zh_choose');
		return true;
	}
	if (!zh_autoLang_t && !zh_autoLang_s) return false;
	if (getCookie('zh_autoLang_checked')) return false;
	if (navigator.language) {
		zh_browserLang = navigator.language;
	} else if (navigator.browserLanguage) {
		zh_browserLang = navigator.browserLanguage;
	}
	if (zh_autoLang_t && zh_langReg_t.test(zh_browserLang)) {
		zh_choose = 't';
	} else if (zh_autoLang_s && zh_langReg_s.test(zh_browserLang)) {
		zh_choose = 's';
	}
	zh_autoLang_checked = 1;
	setCookie('zh_choose', zh_choose, zh_expires);
	if (zh_choose == zh_default) return false;
	return true;
}


function zh_init() {
	zh_getLang();
	c = document.getElementById(zh_class + '_' + zh_choose);
	if (zh_choose != zh_default) {
		if (window.onload) {
			window.onload_before_zh_init = window.onload;
			window.onload = function () {
				zh_tran(zh_choose);
				if (getCookie('zh_autoLang_check')) { alert(zh_autoLang_msg); };
				window.onload_before_zh_init();
			};
		} else {
			window.onload = function () {
				zh_tran(zh_choose);
				if (getCookie('zh_autoLang_check')) { alert(zh_autoLang_msg); };
			};
		}
	}

}
zh_init();